{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__[문제 1: 입구의 수수께끼]__\n",
    "\n",
    "<br>\n",
    "\n",
    "섬의 입구에 도착한 당신은 좋지 않은 느낌을 받습니다. 무언가 비릿한 냄새가 여기저기에서 납니다.\n",
    "\n",
    "아마도 나보다 앞서 도착한 도전자들의 시체가 썩는 냄새인 것 같습니다. \n",
    "\n",
    "지금...누군가 당신을 지켜보고 있습니다. 한시라도 빠르게 이 섬을 탈출해야 합니다. \n",
    "\n",
    "우선 이 거대한 돌문을 열고 섬의 더 깊숙한 곳으로 들어가야 합니다. 돌문을 열려면 두 개의 열쇠 숫자를 더해야 합니다. \n",
    "\n",
    "열쇠 숫자는 14와 29입니다. \n",
    "\n",
    "__돌문을 여는 숫자__ 를 구해주세요."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : 14 + 29\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "key1 = 14\n",
    "key2 = 29\n",
    "result1 = key1 + key2\n",
    "print(result1) \n",
    "```\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/>\n",
    "<br>\n",
    "\n",
    "__[문제 2: 첫 번째 강의 다리]__\n",
    "\n",
    "<br>\n",
    "\n",
    "\n",
    "\n",
    "돌문을 지나자 거친 강물이 흐르는 강이 나타났습니다. \n",
    "\n",
    "아주 낡은 나무 다리가 힘겹게 메달려 있습니다. \n",
    "\n",
    "당장이라도 무너질 것 같지만 이 다리 말고는 반대편으로 갈 수 있는 길이 보이지 않습니다. \n",
    "\n",
    "무언가 불길한 기운이 계속 가까워지는 것만 같아 당신 빠르게 다리를 건너야 합니다. \n",
    "\n",
    "다리는 50kg 이상 버티지 못하기 때문에 68kg인 당신은 무게를 줄여야 합니다.\n",
    "\n",
    "방금 전 돌문을 통과하면서 얻은 마법 룬을 이용해 무게를 줄일 수 있습니다. \n",
    "\n",
    "다리를 건너기 위해 줄여야 할 __최소 무게__ 를 구해주세요. (이상, 이하, 초과, 미만은 신경쓰지 않습니다!)\n",
    "\n",
    "\n",
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : 68 - 50 \n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "``` python\n",
    "current_weight = 68\n",
    "limit = 50\n",
    "weight_to_lose = current_weight - limit\n",
    "print(weight_to_lose)  \n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "<hr/>\n",
    "<br>\n",
    "\n",
    "__[문제 3: 숲 속의 고목나무]__\n",
    "\n",
    "<br>\n",
    "\n",
    "\n",
    "\n",
    "첫 번째 강을 건너자 으스스한 숲 속에 들어섰습니다. \n",
    "\n",
    "귀를 찢는 울음소리가 숲 속에 울려 퍼집니다. 당신은 바로 오래된 고목나무 숲으로 몸을 숨깁니다. \n",
    "\n",
    "숲 깊이 들어가자 고목 나무에 걸린 현판이 보입니다.\n",
    "\n",
    "\"나무의 나이를 구하고 연못으로 가라\"\n",
    "\n",
    "나무의 나이를 구하기 위해서는 4년마다 한 번의 나이테가 생깁니다. \n",
    "\n",
    "돌문을 열때 사용한 숫자를 나이테 개수로 사용하여 __나무의 나이__ 를 구하세요.\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Tips__\n",
    "- 문제 1의 결과값을 참고하세요 !"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "돌문을 열 때 사용한 숫자는 [문제 1]에서 구한 답입니다. \n",
    "\n",
    "- `예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂`\n",
    "\n",
    "[문제 3]을 해결하기 위해서는 변수 라는 개념이 필요합니다!\n",
    "\n",
    "변수란 간단하게 말해서 값을 넣는 공간을 의미하는데요, \n",
    "\n",
    "아직 몰라도 됩니다!!! 변수 관련 내용은 chapter 5에서 배울 예정입니다! \n",
    "\n",
    "미리 공부해보고 싶다면 [[링크]](https://tcpschool.com/python2018/python_datatype_variable) 로 이동하거나, 직접 검색해보세요!\n",
    "검색을 해서 이해하는 것도 좋은 경험이 될 거에요 :)\n",
    "\n",
    "다시 [문제 1]로 돌아가서 변수를 이용해서 해결해보고, 다음 [문제 3]까지 해결해보세요 😊\n",
    "\n",
    "```python\n",
    "rings = result1\n",
    "years_per_ring = 4\n",
    "age = rings * years_per_ring\n",
    "print(age) \n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/><br>\n",
    "\n",
    "__[문제 4: 숲 속의 마법 연못]__\n",
    "\n",
    "<br>\n",
    "\n",
    "\n",
    "\n",
    "고목나무를 지나자 신비로운 마법 연못이 나타났습니다. \n",
    "\n",
    "연못 속에는 불가사의한 에너지가 흐르고 있습니다. \n",
    "\n",
    "이 에너지를 이용하면 보물을 찾는 데 필요한 단서를 얻을 수 있습니다. \n",
    "\n",
    "연못의 깊이를 측정하려면 나무의 나이를 이용해야 합니다. \n",
    "\n",
    "나무의 나이가 172살이고, 연못의 깊이는 나무 나이의 1/4입니다. \n",
    "\n",
    "__연못의 깊이__ 를 구하세요.\n",
    "\n",
    "<br>\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : 172 / 4\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "age = 172\n",
    "pond_depth = age / 4\n",
    "print(pond_depth)  # 43.0\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/><br>\n",
    "\n",
    "__[문제 5: 사원의 입구]__\n",
    "\n",
    "<br>\n",
    "\n",
    "\n",
    "\n",
    "연못을 지나니 고대 사원이 나타났습니다. 사원의 입구에는 비밀번호를 입력해야 합니다. \n",
    "\n",
    "비밀번호는 3자리 수로, 첫 번째 자리는 5, 두 번째 자리는 돌문을 여는 숫자의 십의 자리 수, 세 번째 자리는 돌문을 여는 숫자의 일의 자리 수의 3분의 1입니다. \n",
    "\n",
    "__비밀번호__ 를 구하세요.\n",
    "\n",
    "<br>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : print(\"비밀번호:\", 5 * 100 + (93 // 10) * 10 + (93 % 10) // 3)\n",
    "\n",
    "[문제 5]를 쉽게 해결하기 위해서는 변수 라는 개념이 필요합니다!\n",
    "\n",
    "앞서 [문제 3]을 잘 해결해보셨나요?\n",
    "그렇다면 이미 변수에 대해 알고 있어요! 물론 아직 몰라도 됩니다!!!\n",
    "변수 내용은 chapter 5에서 배울 예정입니다! \n",
    "\n",
    "미리 공부해보고 싶다면 [링크] 로 이동하거나, 직접 검색해보세요!\n",
    "검색을 해서 이해하는 것도 좋은 경험이 될 거에요 :)\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "first_digit = 5\n",
    "second_digit = result1 // 10\n",
    "third_digit = second_digit // 3\n",
    "password = f\"{first_digit}{second_digit}{third_digit}\"\n",
    "print(password)  # 541\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/><br>\n",
    "\n",
    "__[문제 6: 비밀의 동굴]__\n",
    "\n",
    "<br>\n",
    "\n",
    "사원 내부에 비밀의 동굴로 이어지는 통로가 있습니다. \n",
    "\n",
    "무언가 쿵 하고 넘어지는 소리가 들렸습니다. 신경을 곤두세우는 까마귀 소리가 여기저기서 울려 퍼집니다. \n",
    "\n",
    "주변을 멤돌던 존재가 사원에 진입한것 같습니다.\n",
    "\n",
    "어서 동굴을 벗어나야할 것 같습니다.\n",
    "\n",
    "동굴을 열려면 암호를 풀어야 합니다. 암호는 돌문을 열때 사용한 숫자의 제곱근과 같습니다. \n",
    "\n",
    "__암호__ 를 구하세요.\n",
    "\n",
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : 43  ** 0.5\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "code = result1 ** 0.5\n",
    "print(int(code)) \n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/><br>\n",
    "\n",
    "__[문제 7: 해변의 파도]__\n",
    "\n",
    "<br>\n",
    "\n",
    "\n",
    "비밀의 동굴을 지나 해변에 도착했습니다. \n",
    "\n",
    "동굴에서 빠져나오진 못한 존재는 엄청난 촉수를 가진 거대 외계인으로 보입니다. 외계인은 당신을 보며 군침을 흘리고 있습니다. 빠르게 이곳을 탈출해 섬의 반대편으로 도망가야 합니다.\n",
    "\n",
    "배를 타고 빠르게 벗어나기 위해 우선 파도를 파악해야합니다. \n",
    "\n",
    "파도가 일정한 간격으로 오고 있음을 발견했습니다. \n",
    "\n",
    "5분 동안 20번의 파도가 왔다면, 파도 한 번이 오는 데 걸리는 __평균 시간__ 을 구하세요.\n",
    "\n",
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : (5 * 60) // 20\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "minutes = 5\n",
    "waves = 20\n",
    "seconds_per_minute = 60\n",
    "total_seconds = minutes * seconds_per_minute\n",
    "average_time = (total_seconds // waves)\n",
    "print(average_time) \n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/><br>\n",
    "\n",
    "__[문제 8: 폭포의 높이]__\n",
    "\n",
    "<br>\n",
    "\n",
    "섬의 반대편의 무사히 도착했습니다. \n",
    "\n",
    "거대한 폭포가 당신의 길을 가로 막고 있습니다. \n",
    "\n",
    "자세히 보니 폭포 위쪽에 반짝이는 무언가가 있습니다. 당신이 찾던 보물일 수 있습니다.\n",
    "\n",
    "마법 룬을 이용해 폭포의 높이를 구하고 폭포의 위로 올라갑니다.\n",
    "\n",
    "물방울이 떨어져 땅에 닿는 데 걸리는 시간은 2초입니다. 중력가속도는 9.8m/s²입니다. \n",
    "\n",
    "돌문을 열때 사용한 숫자를 이용해 __폭포의 높이__ 를 구하세요. (단, 공기저항은 무시합니다.)\n",
    "\n",
    "<br>\n",
    "\n",
    "\n",
    "__Tips__\n",
    "- 높이 = 0.5 * 중력가속도 * (시간 + 돌문의 숫자의 마지막 자리 수)²\n",
    "\n",
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : 0.5 * 9.8 * ((2 + 3) ** 2)\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "gravity = 9.8\n",
    "time = 2 + 3\n",
    "height = 0.5 * gravity * time ** 2\n",
    "print(height)\n",
    "```  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr/>\n",
    "<br>\n",
    "\n",
    "__[최종 문제: 탈출 비밀번호]__\n",
    "\n",
    "<br>\n",
    "\n",
    "보물을 찾았습니다.\n",
    "\n",
    "쿠우에에이이이이이이\n",
    "\n",
    "\n",
    "에일리언이 당신을 쫓아왔습니다. 당신은 곧 에일리언의 좋은 영양소가 될 것 같습니다.\n",
    "\n",
    "당신은 지금 정신을 차리고 앞에 보이는 에일리언의 우주선을 뻇어 섬을 탈출해야합니다.\n",
    "\n",
    "우주선에 타기 위해서는 비밀번호를 입력해야 합니다.\n",
    "\n",
    "비밀번호는 현재 좌표의 첫 번째 숫자와 세 번째 숫자의 차와 같습니다. \n",
    "\n",
    "__비밀번호__ 를 알아내세요!\n",
    "\n",
    "<br>\n",
    "\n",
    "현재 좌표 : 32, 43, 128\n",
    "\n",
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "정답 : 128 - 32\n",
    "\n",
    "예제 코드는 변수를 이용한 코드입니다.\n",
    "추가로 공부하고 싶다면 아래의 코드를 참고해주세요 🙂\n",
    "\n",
    "```python\n",
    "first_num = 32\n",
    "third_num = 128\n",
    "password = third_num - first_num\n",
    "print(password)  \n",
    "```"
   ]
  }
 ],
 "metadata": {
  "colab": {
   "authorship_tag": "ABX9TyM3gebHvdgzn1rFsPHWTyo9",
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
